{
    "Projects": [
        {"Title": "Hangman",
            "Desc": "As a way to teach myself React.js, I created a simple game of hangman. Initially created a few years ago as a semi-functional and poorly structured program, it has since been remade with React best practices I picked up at my university co-op placement. The goal is to provide the player with a random Wikipedia article title to guess from the Wikipedia API. The style of the game is heavily influenced by the UI of the video game Persona 5, which also makes use of tarot cards like the Hanged Man.",
            "Image": [{"img": "hangman1.PNG", "alt": "All English letters (Aa-Zz) are hidden from the player. Any irregular letters, numbers, or punctuation characters are shown."},{"img": "hangman2.PNG", "alt": "Players can choose to play on 3 difficulty modes. Easy is the default and allows 10 incorrect guesses before a game over, Hard allows 5 and None allows infinite."},{"img": "hangman3.png", "alt": "Once the title has been successfully guessed, a game over is triggered, or the Give Up button is clicked, the title will allow users to click on it to take them to the corresponding Wikipedia article."}],
            "Year": "2024",
            "Res": "https://wakandacat.github.io/HangmanGameUpdated/"},
        {"Title": "Persona 3 Background",
            "Desc": "A computer background created using Vue.js and deployed to Wallpaper Engine. Initially created using vanilla JavaScript a few years ago, I decided to recreate it with Vue to significantly cut down on the length and improve the cleanliness of the code. The goal of this project was to imitate the UI from the video game Persona 3 Portable, one of my personal favourites. This background displays the current date, the time of day, the phase of the moon and indicates how many days are left until a full moon, all of which is good to keep track of for both myself and the game characters. The background images are pulled directly from the game files.",
            "Image": [{"img": "p3back.PNG", "alt": "As the game characters attend high school, After School is one of the times of day listed in the UI. Others include Morning, Lunch, Evening and Late Night."},{"img": "p3back2.PNG", "alt": "More memorable phases of the moon, such as Quarter, Half and Full moons are spelled out directly."},{"img": "temp.jpg", "alt": "Notable times of day and background images are different during weekends."},{"img": "temp2.jpg", "alt": "A major concept of the game is a hidden hour after midnight everyday called the Dark Hour where everything becomes a sickly green, the world distorts, and monsters roam about."}],
            "Year": "2024",
            "Res": "https://wakandacat.github.io/P3BackgroundVUE/"},
        {"Title": "Some android studio game",
            "Desc": "This phone is from 1957 and was manufactured by Northern Electric Co. Ltd. Canada from Montreal, Quebec.",
            "Image": [{"img": "temp.jpg", "alt": "what it looks like normally"}],
            "Year": "2024",
            "Res": ""},
        {"Title": "Portfolio",
            "Desc": "This portfolio lol, i have made a few before with vanilla js",
            "Image": [{"img": "temp.jpg", "alt": "what it looks like normally"},{"img": "temp.jpg", "alt": "old version"},{"img": "temp.jpg", "alt": "different time of day"}],
            "Year": "2025",
            "Res": ""},
        {"Title": "Flower Flux",
            "Desc": "",
            "Image": [{"img": "gatsbee2.PNG", "alt": "what it looks like normally"},{"img": "gatsbee1.PNG", "alt": "old version"},{"img": "gatsbee3.PNG", "alt": "different time of day"}],
            "Year": "2022",
            "Res": "https://ginettegonzales.itch.io/flower-flux"},
        {"Title": "Bird Controller & Game",
            "Desc": "This is a glass griffin low form with pour-out beaker. It was manufactured by Corning Glass Works in the US.",
            "Image": [{"img": "p3back.PNG", "alt": "what it looks like normally"},{"img": "p3back.PNG", "alt": "old version"}],
            "Year": "2022",
            "Res": ""},
        {"Title": "The Little Robot",
            "Desc": "The Little Robot is a linear 3D platforming and melee combat game where you play as a small robot trapped in an isolated testing facility, unaware of the world beyond its walls. This game created with 5 peers as our final year 8-month Capstone project in Unity. As the team lead, I took on the infrastructure of the game including scene management and checkpoints. I was also responsible for the majority of the environmental scripting such as the conveyor belts, moving platforms, and vent systems. I was also responsible for creating the cutscenes sequences and implementing the (many) cameras using the Cinemachine plugin.",
            "Image": [{"img": "robotPlat.gif", "alt": "The robot must traverse through platforming sections as he descends deeper into the facility."},{"img": "narrRoom.png", "alt": "Explore a mysterious facility where dangerous fungus runs rampant."},{"img": "robotComb.gif", "alt": "The robot must defeat a dangerous reoccuring enemy with its fast-paced attacks."}],
            "Year": "2025",
            "Res": "https://wakandacat.wixsite.com/the-little-robot"},
        {"Title": "Cats & Chaos",
            "Desc": "This shelf clock (Eclipse model) was manufactured by Pequegnat, Arthur Clock Co. in Kitchener, Ontario. It is dated between 1904 and 1943.",
            "Image": [{"img": "p3back.PNG", "alt": "what it looks like normally"},{"img": "p3back.PNG", "alt": "old version"}],
            "Year": "2023",
            "Res": ""},
        {"Title": "Crab Cove",
            "Desc": "Crab Cove is a relaxing game about a crab collecting items to decorate his sandcastle! Created by myself and 3 peers to fulfill the challenge of making a unique player controller for our 4th year Advanced Game Dev course in Unity, I was responsible for developing the crab's sideways movement and item spawning with C#, as well as the camerawork with the Cinemachine plugin.",
            "Image": [{"img": "crabHome.png", "alt": "Help the crab collect treasures for his home!"},{"img": "crabDig.PNG", "alt": "The crab can dig holes in the sand to find various items."},{"img": "crabGrab.PNG", "alt": "The crab can pick up items with either claw to bring them back to his sandcastle home and decorate it."}],
            "Year": "2024",
            "Res": "https://trisren.itch.io/crab-cove"},
        {"Title": "Garden Planner",
            "Desc": "react + django",
            "Image": [{"img": "p3back.PNG", "alt": "what it looks like normally"}],
            "Year": "2024",
            "Res": ""},
        {"Title": "Snowball Sandbox",
            "Desc": "might switch this to assignment 3",
            "Image": [{"img": "snowball1.PNG", "alt": "what it looks like normally"}, {"img": "snowball2.PNG", "alt": "what it looks like normally"}],
            "Year": "2024",
            "Res": ""}
    ]  
}